#include "eeprom.h"


/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：i2c_init
函数功能：i2c初始化
输入    ：无
输出    ：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void i2c_init(void)
{
	SDA = 1; 
	SCL = 1; 
	delay_4nop();	
}
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：i2c_start
函数功能：i2c开始信号
输入    ：无
输出    ：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void i2c_start(void) 
 
{ 
   SDA = 1; 
   SCL = 1; 
   delay_9nop(); 
   SDA = 0; 
   delay_9nop(); 
   SCL = 0; 
} 
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：i2c_stop
函数功能：i2c停止信号
输入    ：无
输出    ：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void i2c_stop(void) 
{ 
   SDA = 0; 
   SCL = 1;
   delay_9nop(); 
   SDA = 1; 
   delay_9nop(); 
   SDA = 0; 
} 
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：read_eeprom
函数功能: 从AT24C0256读取数据到MCU 
输入    ：无
输出    : uchar read_data
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
uchar read_eeprom(void) 
{ 
   uchar i,read_data; 				
   for(i = 0; i < 8; i++) 
   { 
    SCL = 1; 
    read_data <<= 1; 
    read_data |= SDA; 
    SCL = 0; 
   } 
    return(read_data); 
}
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：write_eeprom
函数功能：从MCU写入数据到AT24C256 
输入    ：uchar write_data
输出    : bit ack_bit
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/ 
bit write_eeprom(uchar write_data)   
{ 
   uchar i; 
   bit ack_bit; 
   for(i = 0; i < 8; i++)   // 循环移入8个位 
   { 
    SDA = (bit)(write_data & 0x80); 
    _nop_(); 
    SCL = 1; 
    delay_9nop(); 
    SCL = 0; 
    write_data <<= 1; 
   } 
   SDA = 1;                     // 读取应答 
   delay_9nop(); 
   SCL = 1; 
   delay_9nop(); 
   ack_bit = SDA; 
   SCL = 0; 
   return ack_bit;            // 返回AT24C02应答位 
} 
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：werite_eeprom_interrupt
函数功能：在中断程序中从MCU写入数据到AT24C256中
输入参数：uchar k
输出参数：bit ack_biti
备注    : 解决keil编译器会出现重新到用该函数警告
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
bit write_eeprom_interrupt(uchar write_datai)   
{ 
   uchar i; 
   bit ack_biti; 
   for(i = 0; i < 8; i++)   // 循环移入8个位 
   { 
    SDA = (bit)(write_datai & 0x80); 
    _nop_(); 
    SCL = 1; 
    delay_9nop(); 
    SCL = 0; 
    write_datai <<= 1; 
   } 
   SDA = 1;                     // 读取应答 
   delay_9nop(); 
   SCL = 1; 
   delay_9nop(); 
   ack_biti = SDA; 
   SCL = 0; 
   return ack_biti;            // 返回AT24C02应答位 
} 
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：write_byte
函数功能：在指定地址addr处写入数据write_data
输入    ：uint addr,uchar write_data
输出    ：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/ 
void write_byte(uint addr, uchar write_data)   
{ 
   i2c_start(); 
   write_eeprom_interrupt(addr_write);
   write_eeprom_interrupt(addr>>8);  
   write_eeprom_interrupt(addr); 
   write_eeprom_interrupt(write_data); 
   i2c_stop(); 
   delay1ms(10);          // 写入周期 
} 
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：write_byte1
函数功能：在指定地址addr1处写入数据write_data
输入    ：addr,write_data
输出    ：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void write_byte1(uint addr, uchar write_data)   
{ 
   i2c_start(); 
   write_eeprom_interrupt(addr_write1);
   write_eeprom_interrupt(addr>>8);  
   write_eeprom_interrupt(addr); 
   write_eeprom_interrupt(write_data); 
   i2c_stop(); 
   delay1ms(10);          // 写入周期 
} 

/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：read_current
函数功能：在当前地址读取
输入    ：无
输出    ：uchar read_data
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/  
uchar read_current(void)   
{ 
   uchar read_data; 
   i2c_start(); 
   write_eeprom(addr_read); 
   read_data = read_eeprom(); 
   i2c_stop(); 
   return read_data; 
} 
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：read_current1
函数功能：在当前地址读取
输入    ：无
输出    ：uchar read_data
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/ 
uchar read_current1(void)   
{ 
   uchar read_data; 
   i2c_start(); 
   write_eeprom(addr_read1); 
   read_data = read_eeprom(); 
   i2c_stop(); 
   return read_data; 
}
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：read_random
函数功能：在指定地址读取
输入    ：无
输出    ：uchar read_data
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/ 
uchar read_random(uint random_addr)  
{ 
   i2c_start(); 
   write_eeprom(addr_write); 
   write_eeprom(random_addr>>8);
   write_eeprom(random_addr);
   return(read_current()); 
} 
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：read_random1
函数功能：在指定地址读取
输入    ：无
输出    ：uchar read_data
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/ 
uchar read_random1(uint random_addr)  
{ 
   i2c_start(); 
   write_eeprom(addr_write1); 
   write_eeprom(random_addr>>8);
   write_eeprom(random_addr);
   return(read_current1()); 
}