#include "ps2.h"

uchar  HAND;                       
uchar  xdata RES[6]; 
uchar  keybuf0;  				//手柄按键编码存储单元
uchar  keybuf1;

uint t;   
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：delay
函数功能：用于PS2手柄短暂的延时
输入参数：uchar k
输出参数：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void delay(uchar k)          
{
   uchar i;
   for(i=0;i<k;i++);
}
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：ps2_out
函数功能：PS2发送信号
输入参数：无
输出参数：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void ps2_out(void)				//主机接收子程序            
{
    int j,k;
    unsigned char duf=0;
    j=1;
    for(k=0;k<=7;k++)       //逐位发送 
    {
       CLK=1;
       delay(5);
       CLK=0;
       delay(5);
       if(DAT==1)
          duf=duf+j;
       j=j*2;
       CLK=1;
       delay(5);
    }
    RES[t++]=duf;
}
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：ps2_inout
函数功能：PS2手柄接受信号
输入参数：无
输出参数：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/ 
void ps2_inout(void)			//手柄发送子程序
{
    uchar buf,duf=0;
    uchar i,j=1;
    buf=HAND;
    for(i=0;i<=7;i++)   //逐位接收     
    {
     CLK=1;
     delay(5);
     if(buf&0x01)
        CMND=1;
     else
        CMND=0;
     buf=buf>>1;
     CLK=0;
     delay(5);
     if(DAT==1)
        duf=duf+j;
     j=j*2;
     CLK=1;
     delay(5);
    }
    RES[t++]=duf;
	if(t==6)
	t=0;
}
/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：key_scan
函数功能：PS2按键扫描
输入参数：无
输出参数：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/ 
void key_scan(void)	
{
	
    t=0;
    ATT=0;         //主机读手柄先拉低ATT
    HAND=0x01;     //主机发送开始命令
    ps2_inout();     //0xff
    delay(5);
    HAND=0x42;     //主机发送请求数据命令
    ps2_inout();     //0x41：手柄返回请求应答信号
    delay(25);
    ps2_out();       //0x5A
    delay(25);
    ps2_out(); 	   //keybuf0(空0xff)  //手柄返回按键编码第一字节
    delay(25);
    ps2_out();       //keybuf1(空0xff)  //手柄返回按键编码第二字节
    keybuf0=RES[3];              
    keybuf1=RES[4];
    delay(10);
    ATT=1;
}
