#include "timer.h"

bit timer0_end=0;

/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：timer0_init
函数功能：t0定时器初始化，用于舵机2.5ms定时
输入    ：无 
输出    ：无
备注    ：没有开启定时
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void timer0_init(void)
{
	AUXR &= 0x7F;				//定时器时钟12T模式
	TMOD |= 0x01;
	IP   |= 0x02;				//PT0=1;
	IPH  |= 0x02;				//PT0H=1；PTH0:PT0=1:1定时器0为最高中断优先级（优先级3）
	TH0=0xee;			        //22.1184MHz,2.5Ms定时ee00
	TL0=0x00;
	ET0=1;						
	EA=1;
	timer0_end=1;
}

/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：timer0_start
函数功能：同周期定时器0设置及启动程序，使每变化一个变化量的周期相同	 给寄存器填值
输入    ：uint THTL
输出    ：无
 **********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void timer0_start(uint THTL)
{
	TH0=THTL>>8;			  //22.1184MHz,2.5Ms定时ee00
	TL0=THTL;
	timer0_end=0;
	TR0=1;
}

/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：void timer0_interrupt(void) interrupt 1
函数功能：定时器t0中断服务函数函数	中断一次填一次值 标记一次一个2.5ms到了
输入    ：无
输出    ：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/

void timer0_interrupt(void) interrupt 1
{  
   TH0=0xee;		     //22.1184MHz,2.5Ms定时ee00
   TL0=0x00;
   timer0_end=1;
}

/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：timer1_init
函数功能：t1定时器初始化，用于红外遥控解码定时
输入    ：无 
输出    ：无
备注    ：没有开启定时
 **********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/
void timer1_init(void)
{	
    AUXR &= 0xbf;              //timer1 work in 12T mode
    TMOD |= 0x10;              //set timer1 as mode1 (16-bit)

	IP   |= 0x04;				//PT1=1;
	IPH  |= 0x04;				//PT1H=1；PT1H:PT1=1:1定时器1为最高中断优先级（优先级3）

    TL1 = 0x00;                //clear initial timer1 low byte
    TH1 = 0x00;                //clear initial timer1 high byte
    ET1 = 1;                   //clear enable timer1 interrupt
    EA = 1;                    //clear open global interrupt switch
	TR1 = 0;                   //clear timer1 stop running
}

/**********************************************<+><+><+><+><+>★【robot】★<+><+><+><+><+>************************************************
函数名称：void timer1_interrupt(void) interrupt 3
函数功能：定时器t0中断服务函数函数	中断一次填一次值 标记一次一个2.5ms到了
输入    ：无
输出    ：无
***********************************************<<<<<<<<<<<<<<<★【robot】★>>>>>>>>>>>>>>>************************************************/

void time1_interrupt() interrupt 3 
{
    TL1 = 0x00;                //reload timer1 low byte
    TH1 = 0x00;                //reload timer1 high byte
}
